bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G471xx.svd
          <register>
            <name>RCC_APB1SMENR1</name>
            <displayName>RCC_APB1SMENR1</displayName>
            <description>APB1 peripheral clocks enable in Sleep and Stop modes register 1</description>
            <addressOffset>0x78</addressOffset>
            <size>0x20</size>
            <resetValue>0xD2FECD3F</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>TIM2SMEN</name>
                <description>TIM2 timer clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>TIM2 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>TIM2 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM3SMEN</name>
                <description>TIM3 timer clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>TIM3 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>TIM3 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM4SMEN</name>
                <description>TIM4 timer clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>TIM4 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>TIM4 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM5SMEN</name>
                <description>TIM5 timer clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>TIM5 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>TIM5 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM6SMEN</name>
                <description>TIM6 timer clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>TIM6 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>TIM6 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TIM7SMEN</name>
                <description>TIM7 timer clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>TIM7 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>TIM7 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CRSSMEN</name>
                <description>CRS timer clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>CRS clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>CRS clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RTCAPBSMEN</name>
                <description>RTC APB clock enable during Sleep and Stop modes
Set and cleared by software</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>RTC APB clock disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>RTC APB clock enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WWDGSMEN</name>
                <description>Window watchdog clocks enable during Sleep and Stop modes
Set and cleared by software. This bit is forced to ‘1’ by hardware when the hardware WWDG option is activated.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Window watchdog clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Window watchdog clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SPI2SMEN</name>
                <description>SPI2 clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SPI2 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SPI2 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SPI3SMEN</name>
                <description>SPI3 clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SPI3 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SPI3 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USART2SMEN</name>
                <description>USART2 clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>USART2 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>USART2 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USART3SMEN</name>
                <description>USART3 clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>USART3 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>USART3 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UART4SMEN</name>
                <description>UART4 clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>UART4 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>UART4 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>UART5SMEN</name>
                <description>UART5 clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>UART5 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>UART5 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C1SMEN</name>
                <description>I2C1 clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I2C1 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I2C1 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C2SMEN</name>
                <description>I2C2 clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I2C2 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I2C2 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>USBSMEN</name>
                <description>USB device clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>USB device clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>USB device clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FDCANSMEN</name>
                <description>FDCAN clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>FDCAN clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>FDCAN clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PWRSMEN</name>
                <description>Power interface clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Power interface clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Power interface clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>I2C3SMEN</name>
                <description>I2C3 clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>I2C3 clocks disabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>I2C3 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LPTIM1SMEN</name>
                <description>Low power timer 1 clocks enable during Sleep and Stop modes
Set and cleared by software.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>LPTIM1 clocks disabled by the clock gating during Sleep and Stop modes</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>LPTIM1 clocks enabled by the clock gating&lt;sup&gt;(1)&lt;/sup&gt; during Sleep and Stop modes</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
