bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G471xx.svd
            <register>
               <name>TR1</name>
               <displayName>TR1</displayName>
               <description>watchdog threshold register 1</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0FFF0000</resetValue>
               <fields>
                  <field>
                     <name>HT1</name>
                     <description>HT1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>AWDFILT</name>
                     <description>AWDFILT</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>LT1</name>
                     <description>LT1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TR2</name>
               <displayName>TR2</displayName>
               <description>watchdog threshold register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00FF0000</resetValue>
               <fields>
                  <field>
                     <name>HT2</name>
                     <description>HT2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LT2</name>
                     <description>LT2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TR3</name>
               <displayName>TR3</displayName>
               <description>watchdog threshold register 3</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00FF0000</resetValue>
               <fields>
                  <field>
                     <name>HT3</name>
                     <description>HT3</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LT3</name>
                     <description>LT3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SQR1</name>
               <displayName>SQR1</displayName>
               <description>regular sequence register 1</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SQ4</name>
                     <description>SQ4</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ3</name>
                     <description>SQ3</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ2</name>
                     <description>SQ2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ1</name>
                     <description>SQ1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>L</name>
                     <description>Regular channel sequence               length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SQR2</name>
               <displayName>SQR2</displayName>
               <description>regular sequence register 2</description>
               <addressOffset>0x34</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SQ9</name>
                     <description>SQ9</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ8</name>
                     <description>SQ8</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ7</name>
                     <description>SQ7</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ6</name>
                     <description>SQ6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ5</name>
                     <description>SQ5</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SQR3</name>
               <displayName>SQR3</displayName>
               <description>regular sequence register 3</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SQ14</name>
                     <description>SQ14</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ13</name>
                     <description>SQ13</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ12</name>
                     <description>SQ12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ11</name>
                     <description>SQ11</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ10</name>
                     <description>SQ10</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SQR4</name>
               <displayName>SQR4</displayName>
               <description>regular sequence register 4</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SQ16</name>
                     <description>SQ16</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SQ15</name>
                     <description>SQ15</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DR</name>
               <displayName>DR</displayName>
               <description>regular Data Register</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RDATA</name>
                     <description>Regular Data converted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JSQR</name>
               <displayName>JSQR</displayName>
               <description>injected sequence register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JSQ4</name>
                     <description>JSQ4</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JSQ3</name>
                     <description>JSQ3</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JSQ2</name>
                     <description>JSQ2</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JSQ1</name>
                     <description>JSQ1</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JEXTEN</name>
                     <description>JEXTEN</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>JEXTSEL</name>
                     <description>JEXTSEL</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>JL</name>
                     <description>JL</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OFR1</name>
               <displayName>OFR1</displayName>
               <description>offset register 1</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OFFSET1_EN</name>
                     <description>OFFSET1_EN</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET1_CH</name>
                     <description>OFFSET1_CH</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SATEN</name>
                     <description>SATEN</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSETPOS</name>
                     <description>OFFSETPOS</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET1</name>
                     <description>OFFSET1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OFR2</name>
               <displayName>OFR2</displayName>
               <description>offset register 2</description>
               <addressOffset>0x64</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OFFSET1_EN</name>
                     <description>OFFSET1_EN</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET1_CH</name>
                     <description>OFFSET1_CH</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SATEN</name>
                     <description>SATEN</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSETPOS</name>
                     <description>OFFSETPOS</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET1</name>
                     <description>OFFSET1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OFR3</name>
               <displayName>OFR3</displayName>
               <description>offset register 3</description>
               <addressOffset>0x68</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OFFSET1_EN</name>
                     <description>OFFSET1_EN</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET1_CH</name>
                     <description>OFFSET1_CH</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SATEN</name>
                     <description>SATEN</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSETPOS</name>
                     <description>OFFSETPOS</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET1</name>
                     <description>OFFSET1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OFR4</name>
               <displayName>OFR4</displayName>
               <description>offset register 4</description>
               <addressOffset>0x6C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OFFSET1_EN</name>
                     <description>OFFSET1_EN</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET1_CH</name>
                     <description>OFFSET1_CH</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SATEN</name>
                     <description>SATEN</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSETPOS</name>
                     <description>OFFSETPOS</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OFFSET1</name>
                     <description>OFFSET1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JDR1</name>
               <displayName>JDR1</displayName>
               <description>injected data register 1</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATA1</name>
                     <description>JDATA1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JDR2</name>
               <displayName>JDR2</displayName>
               <description>injected data register 2</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATA2</name>
                     <description>JDATA2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JDR3</name>
               <displayName>JDR3</displayName>
               <description>injected data register 3</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATA3</name>
                     <description>JDATA3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>JDR4</name>
               <displayName>JDR4</displayName>
               <description>injected data register 4</description>
               <addressOffset>0x8C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>JDATA4</name>
                     <description>JDATA4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AWD2CR</name>
               <displayName>AWD2CR</displayName>
               <description>Analog Watchdog 2 Configuration           Register</description>
               <addressOffset>0xA0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AWD2CH</name>
                     <description>AWD2CH</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AWD3CR</name>
               <displayName>AWD3CR</displayName>
               <description>Analog Watchdog 3 Configuration           Register</description>
               <addressOffset>0xA4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AWD3CH</name>
                     <description>AWD3CH</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>19</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIFSEL</name>
               <displayName>DIFSEL</displayName>
               <description>Differential Mode Selection Register           2</description>
               <addressOffset>0xB0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIFSEL_0</name>
                     <description>Differential mode for channels               0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DIFSEL_1_18</name>
                     <description>Differential mode for channels 15 to               1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>18</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALFACT</name>
               <displayName>CALFACT</displayName>
               <description>Calibration Factors</description>
               <addressOffset>0xB4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CALFACT_D</name>
                     <description>CALFACT_D</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>CALFACT_S</name>
                     <description>CALFACT_S</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
