bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G471xx.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="FDCAN">
         <name>FDCAN1</name>
         <baseAddress>0x40006400</baseAddress>
         <interrupt>
            <name>FDCAN1_IT0</name>
            <description>FDCAN1 interrupt 0</description>
            <value>21</value>
         </interrupt>
         <interrupt>
            <name>FDCAN1_IT1</name>
            <description>FDCAN1 interrupt 1</description>
            <value>22</value>
         </interrupt>              
      </peripheral>
      <peripheral derivedFrom="FDCAN">
         <name>FDCAN2</name>
         <baseAddress>0x40006800</baseAddress>
         <interrupt>
            <name>FDCAN2_IT0</name>
            <description>FDCAN2 interrupt 0</description>
            <value>86</value>
         </interrupt>
         <interrupt>
            <name>FDCAN2_IT1</name>
            <description>FDCAN2 interrupt 1</description>
            <value>87</value>
         </interrupt>		 
      </peripheral>      
      <peripheral>
         <name>UCPD1</name>
         <description>UCPD1</description>
         <groupName>UCPD</groupName>
         <baseAddress>0x4000A000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>UCPD1</name>
            <description>UCPD1</description>
            <value>63</value>
         </interrupt>
         <registers>
            <register>
               <name>CFG1</name>
               <displayName>CFG1</displayName>
               <description>UCPD configuration register 1</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HBITCLKDIV</name>
                     <description>HBITCLKDIV</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>IFRGAP</name>
                     <description>IFRGAP</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TRANSWIN</name>
                     <description>TRANSWIN</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>PSC_USBPDCLK</name>
                     <description>PSC_USBPDCLK</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RXORDSETEN</name>
                     <description>RXORDSETEN</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>TXDMAEN</name>
                     <description>TXDMAEN</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXDMAEN</name>
                     <description>RXDMAEN</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UCPDEN</name>
                     <description>UCPDEN</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFG2</name>
               <displayName>CFG2</displayName>
               <description>UCPD configuration register 2</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RXFILTDIS</name>
                     <description>RXFILTDIS</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXFILT2N3</name>
                     <description>RXFILT2N3</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FORCECLK</name>
                     <description>FORCECLK</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WUPEN</name>
                     <description>WUPEN</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>UCPD configuration register 2</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXMODE</name>
                     <description>TXMODE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TXSEND</name>
                     <description>TXSEND</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXHRST</name>
                     <description>TXHRST</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXMODE</name>
                     <description>RXMODE</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PHYRXEN</name>
                     <description>PHYRXEN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PHYCCSEL</name>
                     <description>PHYCCSEL</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANASUBMODE</name>
                     <description>ANASUBMODE</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ANAMODE</name>
                     <description>ANAMODE</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCENABLE</name>
                     <description>CCENABLE</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FRSRXEN</name>
                     <description>FRSRXEN</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRSTX</name>
                     <description>FRSTX</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDCH</name>
                     <description>RDCH</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC1TCDIS</name>
                     <description>CC1TCDIS</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CC2TCDIS</name>
                     <description>CC2TCDIS</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <displayName>IMR</displayName>
               <description>UCPD Interrupt Mask Register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXISIE</name>
                     <description>TXISIE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXMSGDISCIE</name>
                     <description>TXMSGDISCIE</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXMSGSENTIE</name>
                     <description>TXMSGSENTIE</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXMSGABTIE</name>
                     <description>TXMSGABTIE</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRSTDISCIE</name>
                     <description>HRSTDISCIE</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRSTSENTIE</name>
                     <description>HRSTSENTIE</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUNDIE</name>
                     <description>TXUNDIE</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXNEIE</name>
                     <description>RXNEIE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXORDDETIE</name>
                     <description>RXORDDETIE</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXHRSTDETIE</name>
                     <description>RXHRSTDETIE</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOVRIE</name>
                     <description>RXOVRIE</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXMSGENDIE</name>
                     <description>RXMSGENDIE</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TYPECEVT1IE</name>
                     <description>TYPECEVT1IE</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TYPECEVT2IE</name>
                     <description>TYPECEVT2IE</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRSEVTIE</name>
                     <description>FRSEVTIE</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>UCPD Status Register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXIS</name>
                     <description>TXIS</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXMSGDISC</name>
                     <description>TXMSGDISC</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXMSGSENT</name>
                     <description>TXMSGSENT</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXMSGABT</name>
                     <description>TXMSGABT</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRSTDISC</name>
                     <description>HRSTDISC</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRSTSENT</name>
                     <description>HRSTSENT</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUND</name>
                     <description>TXUND</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXNE</name>
                     <description>RXNE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXORDDET</name>
                     <description>RXORDDET</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXHRSTDET</name>
                     <description>RXHRSTDET</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOVR</name>
                     <description>RXOVR</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXMSGEND</name>
                     <description>RXMSGEND</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXERR</name>
                     <description>RXERR</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TYPECEVT1</name>
                     <description>TYPECEVT1</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TYPECEVT2</name>
                     <description>TYPECEVT2</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TYPEC_VSTATE_CC1</name>
                     <description>TYPEC_VSTATE_CC1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>TYPEC_VSTATE_CC2</name>
                     <description>TYPEC_VSTATE_CC2</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>FRSEVT</name>
                     <description>FRSEVT</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICR</name>
               <displayName>ICR</displayName>
               <description>UCPD Interrupt Clear Register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXMSGDISCCF</name>
                     <description>TXMSGDISCCF</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXMSGSENTCF</name>
                     <description>TXMSGSENTCF</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXMSGABTCF</name>
                     <description>TXMSGABTCF</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRSTDISCCF</name>
                     <description>HRSTDISCCF</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HRSTSENTCF</name>
                     <description>HRSTSENTCF</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXUNDCF</name>
                     <description>TXUNDCF</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXORDDETCF</name>
                     <description>RXORDDETCF</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXHRSTDETCF</name>
                     <description>RXHRSTDETCF</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOVRCF</name>
                     <description>RXOVRCF</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXMSGENDCF</name>
                     <description>RXMSGENDCF</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TYPECEVT1CF</name>
                     <description>TYPECEVT1CF</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TYPECEVT2CF</name>
                     <description>TYPECEVT2CF</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRSEVTCF</name>
                     <description>FRSEVTCF</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TX_ORDSET</name>
               <displayName>TX_ORDSET</displayName>
               <description>UCPD Tx Ordered Set Type           Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXORDSET</name>
                     <description>TXORDSET</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TX_PAYSZ</name>
               <displayName>TX_PAYSZ</displayName>
               <description>UCPD Tx Paysize Register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXPAYSZ</name>
                     <description>TXPAYSZ</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXDR</name>
               <displayName>TXDR</displayName>
               <description>UCPD Tx Data Register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>TXDATA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
