bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32G471xx.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CRS</name>
         <description>CRS</description>
         <groupName>CRS</groupName>
         <baseAddress>0x40002000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>CRS control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00004000</resetValue>
               <fields>
                  <field>
                     <name>SYNCOKIE</name>
                     <description>SYNC event OK interrupt    enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SYNCWARNIE</name>
                     <description>SYNC warning interrupt   enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ERRIE</name>
                     <description>Synchronization or trimming error  interrupt enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ESYNCIE</name>
                     <description>Expected SYNC interrupt   enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CEN</name>
                     <description>Frequency error counter enable This bit     enables the oscillator clock for the frequency error    counter. When this bit is set, the CRS_CFGR register    is write-protected and cannot be               modified.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>AUTOTRIMEN</name>
                     <description>Automatic trimming enable This bit   enables the automatic hardware adjustment of TRIM    bits according to the measured frequency error   between two SYNC events. If this bit is set, the TRIM               bits are read-only. The TRIM value can be adjusted by               hardware by one or two steps at a time, depending on               the measured frequency error value. Refer to               Section7.3.4: Frequency error evaluation and               automatic trimming for more details.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SWSYNC</name>
                     <description>Generate software SYNC event This bit is               set by software in order to generate a software SYNC               event. It is automatically cleared by               hardware.</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TRIM</name>
                     <description>HSI48 oscillator smooth trimming These               bits provide a user-programmable trimming value to               the HSI48 oscillator. They can be programmed to               adjust to variations in voltage and temperature that               influence the frequency of the HSI48. The default               value is 32, which corresponds to the middle of the               trimming interval. The trimming step is around 67 kHz               between two consecutive TRIM steps. A higher TRIM               value corresponds to a higher output frequency. When               the AUTOTRIMEN bit is set, this field is controlled               by hardware and is read-only.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR</name>
               <displayName>CFGR</displayName>
               <description>This register can be written only when the           frequency error counter is disabled (CEN bit is cleared           in CRS_CR). When the counter is enabled, this register is           write-protected.</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x2022BB7F</resetValue>
               <fields>
                  <field>
                     <name>RELOAD</name>
                     <description>Counter reload value RELOAD is the value   to be loaded in the frequency error counter with each   SYNC event. Refer to Section7.3.3: Frequency error  measurement for more details about counter               behavior.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>FELIM</name>
                     <description>Frequency error limit FELIM contains the   value to be used to evaluate the captured frequency error value latched in the FECAP[15:0] bits of the   CRS_ISR register. Refer to Section7.3.4: Frequency               error evaluation and automatic trimming for more               details about FECAP evaluation.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SYNCDIV</name>
                     <description>SYNC divider These bits are set and     cleared by software to control the division factor of   the SYNC signal.</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>SYNCSRC</name>
                     <description>SYNC signal source selection These bits      are set and cleared by software to select the SYNC  signal source. Note: When using USB LPM (Link Power  Management) and the device is in Sleep mode, the               periodic USB SOF will not be generated by the host.               No SYNC signal will therefore be provided to the CRS               to calibrate the HSI48 on the run. To guarantee the               required clock precision after waking up from Sleep               mode, the LSE or reference clock on the GPIOs should               be used as SYNC signal.</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SYNCPOL</name>
                     <description>SYNC polarity selection This bit is set  and cleared by software to select the input polarity   for the SYNC signal source.</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <displayName>ISR</displayName>
               <description>CRS interrupt and status    register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNCOKF</name>
                     <description>SYNC event OK flag This flag is set by  hardware when the measured frequency error is smaller   than FELIM * 3. This means that either no adjustment   of the TRIM value is needed or that an adjustment by               one trimming step is enough to compensate the               frequency error. An interrupt is generated if the               SYNCOKIE bit is set in the CRS_CR register. It is               cleared by software by setting the SYNCOKC bit in the               CRS_ICR register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCWARNF</name>
                     <description>SYNC warning flag This flag is set by  hardware when the measured frequency error is greater than or equal to FELIM * 3, but smaller than FELIM *   128. This means that to compensate the frequency               error, the TRIM value must be adjusted by two steps               or more. An interrupt is generated if the SYNCWARNIE               bit is set in the CRS_CR register. It is cleared by               software by setting the SYNCWARNC bit in the CRS_ICR               register.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRF</name>
                     <description>Error flag This flag is set by hardware     in case of any synchronization or trimming error. It    is the logical OR of the TRIMOVF, SYNCMISS and SYNCERR bits. An interrupt is generated if the ERRIE               bit is set in the CRS_CR register. It is cleared by               software in reaction to setting the ERRC bit in the               CRS_ICR register, which clears the TRIMOVF, SYNCMISS               and SYNCERR bits.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESYNCF</name>
                     <description>Expected SYNC flag This flag is set by    hardware when the frequency error counter reached a    zero value. An interrupt is generated if the ESYNCIE bit is set in the CRS_CR register. It is cleared by               software by setting the ESYNCC bit in the CRS_ICR               register.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCERR</name>
                     <description>SYNC error This flag is set by hardware   when the SYNC pulse arrives before the ESYNC event    and the measured frequency error is greater than or   equal to FELIM * 128. This means that the frequency               error is too big (internal frequency too low) to be               compensated by adjusting the TRIM value, and that               some other action should be taken. An interrupt is               generated if the ERRIE bit is set in the CRS_CR               register. It is cleared by software by setting the               ERRC bit in the CRS_ICR register.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCMISS</name>
                     <description>SYNC missed This flag is set by hardware  when the frequency error counter reached value FELIM * 128 and no SYNC was detected, meaning either that a  SYNC pulse was missed or that the frequency error is               too big (internal frequency too high) to be               compensated by adjusting the TRIM value, and that               some other action should be taken. At this point, the               frequency error counter is stopped (waiting for a               next SYNC) and an interrupt is generated if the ERRIE               bit is set in the CRS_CR register. It is cleared by               software by setting the ERRC bit in the CRS_ICR               register.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRIMOVF</name>
                     <description>Trimming overflow or underflow This flag is set by hardware when the automatic trimming tries to over- or under-flow the TRIM value. An interrupt  is generated if the ERRIE bit is set in the CRS_CR               register. It is cleared by software by setting the               ERRC bit in the CRS_ICR register.</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FEDIR</name>
                     <description>Frequency error direction FEDIR is the  counting direction of the frequency error counter   latched in the time of the last SYNC event. It shows  whether the actual frequency is below or above the               target.</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FECAP</name>
                     <description>Frequency error capture FECAP is the frequency error counter value latched in the time ofthe last SYNC event. Refer to Section7.3.4: Frequency error evaluation and automatic trimming for more               details about FECAP usage.</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICR</name>
               <displayName>ICR</displayName>
               <description>CRS interrupt flag clear register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNCOKC</name>
                     <description>SYNC event OK clear flag Writing 1 to this bit clears the SYNCOKF flag in the CRS_ISR  register.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCWARNC</name>
                     <description>SYNC warning clear flag Writing 1 to this bit clears the SYNCWARNF flag in the CRS_ISR  register.</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERRC</name>
                     <description>Error clear flag Writing 1 to this bit   clears TRIMOVF, SYNCMISS and SYNCERR bits and  consequently also the ERRF flag in the CRS_ISR  register.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESYNCC</name>
                     <description>Expected SYNC clear flag Writing 1 to this bit clears the ESYNCF flag in the CRS_ISR   register.</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
   </peripherals>
</device>
